Repository: b14ckPanther/Wen
Catalog: apps/mobile/lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Wen
ar: وين

# appTagline
source: Arab Business Directory
ar: دليل الأعمال العربي

# tabExplore
source: Explore
ar: اكتشف

# tabCategories
source: Categories
ar: الفئات

# tabSearch
source: Search
ar: بحث

# tabFavorites
source: Favorites
ar: المفضلة

# tabProfile
source: Profile
ar: الملف الشخصي

# adminConsoleTitle
source: Admin Console
ar: لوحة التحكم

# exploreHeadline
source: Discover trending businesses near you
ar: اكتشف أبرز الأعمال القريبة منك

# exploreLocationPermissionRequired
source: Enable location access to find nearby businesses.
ar: قم بتفعيل إذن الموقع للعثور على الأعمال القريبة.

# exploreLocationPermissionCta
source: Enable
ar: تفعيل

# exploreLocationPermissionDeniedForever
source: Location access is blocked. Update your settings to continue.
ar: تم حظر إذن الموقع. حدّث الإعدادات للمتابعة.

# exploreLocationOpenSettings
source: Settings
ar: الإعدادات

# exploreLocationServicesDisabled
source: Location services are turned off on your device.
ar: خدمة الموقع متوقفة على جهازك.

# exploreLocationErrorGeneric
source: We could not determine your location.
ar: تعذّر تحديد موقعك.

# exploreLocationRetry
source: Retry
ar: إعادة المحاولة

# exploreUseMyLocationTitle
source: Use your current location
ar: استخدم موقعك الحالي

# exploreManualRegionTitle
source: Browse by region
ar: استكشف حسب المنطقة

# exploreUseMyLocationToggle
source: Use GPS location
ar: تفعيل الموقع عبر GPS

# exploreUseMyLocationSubtitle
source: Refresh to pull nearby businesses automatically.
ar: حدّث النتائج لإظهار الأنشطة القريبة تلقائيًا.

# exploreManualRegionToggleSubtitle
source: Choose a preset region to explore anywhere.
ar: اختر منطقة جاهزة للاستكشاف أينما كنت.

# exploreManualRegionLabel
source: Select region
ar: اختر المنطقة

# exploreRefreshLocation
source: Refresh location
ar: تحديث الموقع

# exploreSearchShortcut
source: Search businesses, categories, or services…
ar: ابحث عن نشاط أو خدمة…

# exploreSearchAction
source: Search
ar: بحث

# searchPlaceholder
source: Search for businesses or categories
ar: ابحث عن نشاط تجاري أو فئة

# favoritesEmptyTitle
source: No favorites yet
ar: لا توجد عناصر مفضلة بعد

# favoritesEmptySubtitle
source: Save businesses to compare plans and keep them handy.
ar: احفظ الأعمال لمقارنتها لاحقًا والوصول إليها بسرعة.

# profileGuestTitle
source: Welcome to Wen
ar: مرحبًا بك في وين

# profileGuestSubtitle
source: Sign in to manage your business listings and preferences.
ar: سجّل الدخول لإدارة أنشطة أعمالك وإعداداتك.

# businessStatusOpen
source: Open now
ar: مفتوح الآن

# businessStatusClosed
source: Opens soon
ar: سيفتح قريبًا

# searchPopularCategories
source: Popular categories
ar: الفئات الشائعة

# searchRecentSearches
source: Recent searches
ar: عمليات البحث الأخيرة

# searchAll
source: All
ar: الكل

# regionNorth
source: North
ar: الشمال

# regionSouth
source: South
ar: الجنوب

# regionEast
source: East
ar: الشرق

# regionWest
source: West
ar: الغرب

# regionCenter
source: Center
ar: الوسط

# profileSignInCta
source: Sign in
ar: تسجيل الدخول

# authSignInTab
source: Sign in
ar: تسجيل الدخول

# authSignUpTab
source: Create account
ar: إنشاء حساب

# authForgotPassword
source: Forgot password?
ar: نسيت كلمة المرور؟

# authResetTitle
source: Reset password
ar: إعادة تعيين كلمة المرور

# authResetSent
source: Password reset email sent. Check your inbox.
ar: تم إرسال رسالة لإعادة تعيين كلمة المرور. تفقد بريدك الإلكتروني.

# authSignOut
source: Sign out
ar: تسجيل الخروج

# authOwnerRequestButton
source: Request owner access
ar: طلب صلاحيات المالك

# authOwnerRequestSubtitle
source: Owners can manage listings after an admin approves.
ar: بعد موافقة المشرف يمكنك إدارة نشاطك التجاري.

# authOwnerRequestSubmitted
source: Request received. We’ll notify you once an admin approves.
ar: تم استلام طلبك وسيتم إخطارك بعد موافقة المشرف.

# authOwnerRequestPending
source: We received your request. An admin review is required before you can publish a business.
ar: تم استلام طلبك. يجب انتظار موافقة المشرف قبل نشر نشاطك.

# authOwnerRequestRejected
source: Your previous request was declined. Update your details and submit again when ready.
ar: تم رفض طلبك السابق. حدّث بياناتك وقدّم الطلب مرة أخرى عند الجاهزية.

# authManageBusiness
source: Manage my business
ar: إدارة نشاطي التجاري

# authEmailLabel
source: Email
ar: البريد الإلكتروني

# authPasswordLabel
source: Password
ar: كلمة المرور

# authFullNameLabel
source: Full name
ar: الاسم الكامل

# authConfirmPasswordLabel
source: Confirm password
ar: تأكيد كلمة المرور

# authSignInButton
source: Sign in
ar: تسجيل الدخول

# authCreateAccountButton
source: Create account
ar: إنشاء حساب

# authSendResetLink
source: Send reset link
ar: إرسال رابط الاستعادة

# authOwnerSwitchTitle
source: I am a business owner
ar: أنا صاحب نشاط تجاري

# authOwnerSwitchSubtitle
source: Owners can manage business listings in Wen
ar: يستطيع المالك إدارة نشاطه التجاري داخل وين

# authEmailRequired
source: Please enter your email
ar: يرجى إدخال البريد الإلكتروني

# authEmailInvalid
source: Enter a valid email address
ar: أدخل بريدًا إلكترونيًا صالحًا

# authPasswordRequired
source: Please enter your password
ar: يرجى إدخال كلمة المرور

# authPasswordLength
source: Use at least 8 characters
ar: استخدم 8 أحرف على الأقل

# authNameRequired
source: Please enter your name
ar: يرجى إدخال الاسم

# authConfirmPasswordRequired
source: Please confirm your password
ar: يرجى تأكيد كلمة المرور

# authPasswordsDoNotMatch
source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

# businessCreateTitle
source: Create your Wen business profile
ar: أنشئ ملف نشاطك التجاري على وين

# businessUpdateTitle
source: Update your Wen business profile
ar: حدّث ملف نشاطك التجاري على وين

# businessNameLabel
source: Business name
ar: اسم النشاط

# businessDescriptionLabel
source: Business description
ar: وصف النشاط

# businessCategoryLabel
source: Category
ar: الفئة

# businessLatitudeLabel
source: Latitude
ar: خط العرض

# businessLongitudeLabel
source: Longitude
ar: خط الطول

# businessGalleryTitle
source: Gallery
ar: المعرض

# businessSaveFirstMessage
source: Save your business first to upload images.
ar: احفظ بيانات نشاطك أولًا لرفع الصور.

# businessSaveButton
source: Publish business
ar: نشر النشاط

# businessUpdateButton
source: Update business
ar: تحديث النشاط

# businessSaveSuccess
source: Business details saved. Pending admin review.
ar: تم حفظ بيانات النشاط. بانتظار موافقة المشرف.

# businessUploadSuccess
source: Image uploaded successfully.
ar: تم رفع الصورة بنجاح.

# businessNeedCoordinates
source: Enter valid coordinates for latitude and longitude.
ar: أدخل إحداثيات صحيحة لخط العرض والطول.

# businessNeedCategory
source: Select a business category.
ar: اختر فئة للنشاط التجاري.

# businessOwnerUpgradeSuccess
source: You are now marked as a business owner. You can manage your business below.
ar: تم تفعيل حساب المالك. بإمكانك إدارة نشاطك الآن.

# businessAddImage
source: Add image
ar: إضافة صورة

# businessDetailsNotFound
source: We could not load this business right now.
ar: تعذّر تحميل بيانات هذا النشاط الآن.

# businessDetailsRefreshTooltip
source: Refresh
ar: تحديث

# businessDetailsLocationTitle
source: Location
ar: الموقع

# businessDetailsMetaTitle
source: Details
ar: التفاصيل

# businessDetailsUpdatedAtLabel
source: Last updated
ar: آخر تحديث

# businessDetailsApprovalLabel
source: Approval status
ar: حالة الاعتماد

# businessDetailsApprovedStatus
source: Approved
ar: معتمد

# businessDetailsPendingStatus
source: Pending review
ar: قيد المراجعة

# adminConsoleButton
source: Open admin console
ar: فتح لوحة التحكم

# adminPendingBusinessesTitle
source: Pending businesses
ar: أنشطة بانتظار الاعتماد

# adminPendingBusinessesEmpty
source: No businesses awaiting approval.
ar: لا توجد أنشطة بانتظار الاعتماد حاليًا.

# adminApproveAction
source: Approve
ar: اعتماد

# adminRejectAction
source: Reject
ar: رفض

# adminUsersTitle
source: Users
ar: المستخدمون

# adminUsersEmpty
source: No users in the database yet.
ar: لا يوجد مستخدمون حتى الآن.

# adminOwnerRequestsTitle
source: Owner access requests
ar: طلبات صلاحيات المالك

# adminOwnerRequestsEmpty
source: No owner access requests at the moment.
ar: لا توجد طلبات صلاحيات ملاك حاليًا.

# adminOwnerRequestSubtitle
source: Requested owner access
ar: طلب صلاحيات المالك

# adminAllUsersTitle
source: All users
ar: جميع المستخدمين

# adminRoleLabel
source: Role
ar: الدور

# adminStatusLabel
source: Status
ar: الحالة

# adminSetRoleUser
source: Set role: user
ar: تعيين الدور: مستخدم

# adminSetRoleOwner
source: Set role: owner
ar: تعيين الدور: مالك

# adminSetRoleAdmin
source: Set role: admin
ar: تعيين الدور: مشرف

# adminDeleteUser
source: Delete user
ar: حذف المستخدم

# paymentsUpgradeTitle
source: Upgrade plan
ar: ترقية الباقة

# paymentsUpgradeDescription
source: Secure checkout will open in the browser. Payments are not live yet—this flow is a stub until the payments milestone is complete.
ar: سيتم فتح بوابة الدفع في المتصفح. الدفعات غير مفعّلة بعد—هذا المسار تجريبي لحين اكتمال مرحلة المدفوعات.

# paymentsStandardPlan
source: Standard
ar: باقة ستاندرد

# paymentsStandardPrice
source: ₪ 199/mo
ar: 199 ₪ / شهر

# paymentsStandardBenefit1
source: Up to 5 team members
ar: حتى 5 أعضاء فريق

# paymentsStandardBenefit2
source: Priority placement in search
ar: أولوية الظهور في البحث

# paymentsStandardBenefit3
source: Featured badge in explore tab
ar: شارة مميزة في صفحة الاستكشاف

# paymentsPremiumPlan
source: Premium
ar: باقة بريميوم

# paymentsPremiumPrice
source: ₪ 399/mo
ar: 399 ₪ / شهر

# paymentsPremiumBenefit1
source: Unlimited staff accounts
ar: عدد غير محدود من حسابات الموظفين

# paymentsPremiumBenefit2
source: Advanced analytics dashboard
ar: لوحة تحليلات متقدمة

# paymentsPremiumBenefit3
source: Concierge onboarding + AI boosts
ar: إعداد مخصص ودعم بالذكاء الاصطناعي

# paymentsCheckoutStub
source: Proceed to checkout (stub)
ar: الانتقال للدفع (تجريبي)

# paymentsComingSoon
source: Payments coming soon. Stay tuned!
ar: المدفوعات قريبًا. ترقبوا!

# aiSearchButton
source: Ask Wen AI
ar: اسأل وين الذكي

# aiSearchResultsTitle
source: Wen AI suggestions
ar: اقتراحات وين الذكية

# aiSearchConfidence
source: Confidence
ar: درجة الثقة

# aiSearchClearButton
source: Clear AI suggestions
ar: مسح اقتراحات الذكاء

# aiSearchEmptyHint
source: Try the AI assistant to get curated picks for your query.
ar: جرّب المساعد الذكي ليقترح لك خيارات مناسبة لبحثك.

# categoriesTitle
source: Browse categories
ar: تصفح الفئات

# categoriesEmpty
source: No categories available yet.
ar: لا توجد فئات متاحة بعد.

# categoriesViewAll
source: View all
ar: عرض الكل

# categoriesNoSubcategories
source: No subcategories yet.
ar: لا توجد فئات فرعية بعد.

# categoriesNoBusinesses
source: No businesses match this category yet.
ar: لا توجد أنشطة في هذه الفئة حاليًا.

# categoriesRadiusLabel
source: Showing within {radiusKm} km
ar: عرض ضمن {radiusKm} كم

# businessAddressLabel
source: Address
ar: العنوان

# businessAddressHint
source: e.g. Downtown Dubai, Sheikh Zayed Rd
ar: مثال: وسط المدينة، شارع الشيخ زايد

# businessRegionLabel
source: Service region
ar: المنطقة المخدومة

# businessRegionHint
source: Displayed label, e.g. North Coast
ar: يظهر في الملف، مثال: الساحل الشمالي

# businessContactSection
source: Contact & social
ar: وسائل التواصل والحسابات

# businessPhoneLabel
source: Phone number
ar: رقم الهاتف

# businessPhoneHint
source: Include country code e.g. +971…
ar: أدخل رمز الدولة مثال: ‎+972…

# businessWhatsappLabel
source: WhatsApp
ar: واتساب

# businessWhatsappHint
source: WhatsApp number with country code
ar: رقم واتساب مع رمز الدولة

# businessEmailLabel
source: Contact email
ar: البريد للتواصل

# businessWebsiteLabel
source: Website
ar: الموقع الإلكتروني

# businessInstagramLabel
source: Instagram
ar: إنستغرام

# businessFacebookLabel
source: Facebook
ar: فيسبوك

# businessPriceInfoLabel
source: Price / offers
ar: الأسعار / العروض

# businessPriceInfoHint
source: Share pricing highlights or fuel prices.
ar: شارك أهم الأسعار أو عروض الوقود.

# businessDetailsCallAction
source: Call
ar: اتصال

# businessDetailsWhatsAppAction
source: WhatsApp
ar: واتساب

# businessDetailsMapsAction
source: Directions
ar: الاتجاهات

# settingsAppearanceTitle
source: Appearance & language
ar: المظهر واللغة

# settingsThemeLabel
source: Theme
ar: الوضع

# settingsThemeSystem
source: System
ar: بحسب النظام

# settingsThemeLight
source: Light
ar: فاتح

# settingsThemeDark
source: Dark
ar: داكن

# settingsLanguageLabel
source: Language
ar: اللغة

# settingsLanguageEnglish
source: English
ar: الإنجليزية

# settingsLanguageArabic
source: Arabic
ar: العربية

# settingsLoading
source: Loading preferences…
ar: يتم تحميل التفضيلات...
